package myExamples.chapter6.classExample;

//մաս 1
public class Class {
    //Ավելի պրակտիկ class-ը պետք է ունենա իրա մեջ
    // Գլոբալ փոփոխականներ
    //մաս 2
    // հասանելիությունը(ինկապսուլացիա) տիտը անունը;
    // հասանելիությունը(ինկապսուլացիա) տիտը անունը;

    //մաս 3
    //Կանստրուկտորներ - կարողե լինել ոչինչ չնդունող կարեղ է լինել ինչվոր բան ընդունող կամ էլ կարող էնք նաև ընդանրապես չսարքենք։
    //կանստրուկտորները կհայտարարվին էն class-ի անունով որի մեջ ինքը սարքա է
    //օրինակ դատարկ կանստրուկտորը
    // հասանելիությունը(ինկապսուլացիա) class-ի անունը(){

    //}
    //ինչ, որ մի բան ընդունող կանստրուկտոր
    //հասանելիությունը(ինկապսուլացիա) class-ի անունը(ամեն մի փոփոխական իրանց տիպերով){
    // մեր գլեբալ փոփոխականները կհավասարցնենկ կանստրուկտորի փոփոխականներին;
    // մեր գլեբալ փոփոխականները կհավասարցնենկ կանստրուկտորի փոփոխականներին;
    //{

    //մաս 4
    //Մեթոդներ
    //հասանելիությունը(ինկապսուլացիա) եթե ինչ որ մի բան պետք է վերադարցնի-առանց (void) հակառակ դեպքում(void), անուն (ամեն մի փոփոխական իրանց տիպերով){
    //լոգիկան;
    //}

    // հասանելիությունը(ինկապսուլացիա) եթե ինչ որ մի բան պետք է վերադարցնի-առանց (void) հակառակ դեպքում(void), անուն (ամեն մի փոփոխական իրանց տիպերով){
    //լոգիկան;
    //}
}
